In [1]:
#Numpy gets superpwers with Pandas
#Fast data analysis
#Used for Data cleaning and pre processing (example : Filling missing values in data set using mean,correlation,etc)
#Used to create data frames, read data sets (excels,csv files)

In [2]:
import numpy as np
import pandas as pd

In [3]:
#Create a dictionary like series
pd.Series(data=[1,2,3,4],index=['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
#Using series fn on dictionary
dict = {'pranav':1,'saral':2,'tejas':3}
pd.Series(dict)

pranav    1
saral     2
tejas     3
dtype: int64

In [5]:
#Addition of series
seriesone  = pd.Series(data = [1,2,3],index = ['a','b','c'])
seriestwo  = pd.Series(data = [1,9,4,5],index = ['a','b','c','d'])
sum = seriesone+seriestwo
print(sum)
#Values with same key get added, if both series dont have same key we get NaN output

a     2.0
b    11.0
c     7.0
d     NaN
dtype: float64

In [6]:
from numpy.random import randn 
#Importing random number library
mydata = randn(3,4)
#Creating a 3*4 array
mydf = pd.DataFrame(mydata, ['R1','R2','R3'],['C1','C2','C3','C4'])
#Rows and colmns defined (ie R1,R2... and C1,C2... should be same as array rows colmns from which df is being created)
print(mydf)

          C1        C2        C3        C4
R1  0.900751 -0.162082  1.876635 -0.002561
R2  0.945329 -0.162582  0.406085 -0.890640
R3  1.711501 -1.658520 -0.095217  1.390480

In [7]:
mydf['C1']
#To print a coln or row of data frame of which the name is known

R1    0.900751
R2    0.945329
R3    1.711501
Name: C1, dtype: float64

In [8]:
#Creating a new coln from exisitng colmns (like mutate in R)
mydf['C5']= mydf['C1']*mydf['C2']
mydf['C5']

R1   -0.145996
R2   -0.153694
R3   -2.838557
Name: C5, dtype: float64

In [9]:
#To remove row or coln
mydf.drop("C2",axis = 1)
#Axis = 1 to drop coln and 0 to drop index(rows are callled index here)

          C1        C3        C4        C5
R1  0.900751  1.876635 -0.002561 -0.145996
R2  0.945329  0.406085 -0.890640 -0.153694
R3  1.711501 -0.095217  1.390480 -2.838557

In [10]:
mydf
#Above we dropped C2 but u can see it the change was not permanent, this was more of a view without C2, so we set the inplace = True in the above mentioned drop fn

          C1        C2        C3        C4        C5
R1  0.900751 -0.162082  1.876635 -0.002561 -0.145996
R2  0.945329 -0.162582  0.406085 -0.890640 -0.153694
R3  1.711501 -1.658520 -0.095217  1.390480 -2.838557

In [11]:
mydf.drop("C2",axis = 1,inplace= True)

In [12]:
mydf
#Now u see permanent drop thanks to inplace which is by default false

          C1        C3        C4        C5
R1  0.900751  1.876635 -0.002561 -0.145996
R2  0.945329  0.406085 -0.890640 -0.153694
R3  1.711501 -0.095217  1.390480 -2.838557

In [13]:
mydf.loc['R2']
#Used to select sub matrices

C1    0.945329
C3    0.406085
C4   -0.890640
C5   -0.153694
Name: R2, dtype: float64

In [14]:
#If indexes arent name and u want row then we use iloc, to ger R2
mydf.iloc[1]

C1    0.945329
C3    0.406085
C4   -0.890640
C5   -0.153694
Name: R2, dtype: float64

In [15]:
mydf>0

      C1     C3     C4     C5
R1  True   True  False  False
R2  True   True  False  False
R3  True  False   True  False

In [16]:
mydf[mydf>0]

          C1        C3       C4  C5
R1  0.900751  1.876635      NaN NaN
R2  0.945329  0.406085      NaN NaN
R3  1.711501       NaN  1.39048 NaN

In [18]:
#Adding a new index
newindex = ['row1','row2','row3']
mydf['NewIndex'] = newindex
mydf

          C1        C3        C4        C5 NewIndex
R1  0.900751  1.876635 -0.002561 -0.145996     row1
R2  0.945329  0.406085 -0.890640 -0.153694     row2
R3  1.711501 -0.095217  1.390480 -2.838557     row3

In [20]:
#To change exisiting index
mydf.set_index('NewIndex')

                C1        C3        C4        C5
NewIndex
row1      0.900751  1.876635 -0.002561 -0.145996
row2      0.945329  0.406085 -0.890640 -0.153694
row3      1.711501 -0.095217  1.390480 -2.838557

In [21]:
#DataCleanup - Suppose three freinds rate three movies. me = "me", myfriend = 'mf' and my other friend = 'mof'
#Its not compluslory that they have watched all 3 movies
#So here we will need to remove NA values

In [23]:
mydata = {'me':[3,4,np.NaN],'mf':[4,np.NaN,np.NaN],'mof':[3,5,4]}
mydf = pd.DataFrame(mydata)
mydf

    me   mf  mof
0  3.0  4.0    3
1  4.0  NaN    5
2  NaN  NaN    4

In [24]:
#Now for data cleaning we can use the most basic fn, whihc removes rows with null values
mydf.dropna()

    me   mf  mof
0  3.0  4.0    3

In [25]:
#We can also replace NA values by mean of the row or colmn depending on our data set
mydf.fillna(value = mydf['me'].mean())
#We filled the mean of me colmn in all the parts where there was NA

    me   mf  mof
0  3.0  4.0    3
1  4.0  3.5    5
2  3.5  3.5    4

In [30]:
new = {'Movies':['movie 1','movie 1','movie 2','movie 3','movie 2'],'Viewers':['som','om','tej','saral','rohan'],'Ratings':[10,7,7,8,6]}
movieframe = pd.DataFrame(new)
movieframe

    Movies Viewers  Ratings
0  movie 1     som       10
1  movie 1      om        7
2  movie 2     tej        7
3  movie 3   saral        8
4  movie 2   rohan        6

In [31]:
#GroupBy
movieframe.groupby('Movies').mean()

         Ratings
Movies
movie 1      8.5
movie 2      6.5
movie 3      8.0

In [32]:
movieframe.groupby('Movies').std().loc['movie 2']

Ratings    0.707107
Name: movie 2, dtype: float64

In [33]:
movieframe.groupby('Movies').describe()
#Gives mean max min std dev quartile ranges

        Ratings
          count mean       std  min   25%  50%   75%   max
Movies
movie 1     2.0  8.5  2.121320  7.0  7.75  8.5  9.25  10.0
movie 2     2.0  6.5  0.707107  6.0  6.25  6.5  6.75   7.0
movie 3     1.0  8.0       NaN  8.0  8.00  8.0  8.00   8.0

In [34]:
#Reading files using pd
#Save your python notebook in same directory as from where u want to read excel,csv,json file as datas set
#To read csv - pd.read_csv('nameofcsv.csv')

In [35]:
#To read excel - pd.read_excel('Nameofexcel.xlsx')
#To read specific sheet - pd.read_excel('example.xlsx',sheet name = 'Sheet 2')